{
  "laws": [
    {
      "name": "Primordia Hierarchy Law",
      "description": "The universe operates under a hierarchical flow of energy: \n\n 1. **Primordial Energy (Purest Form):** The elemental essence from which all existence originates. Primordial Beings wield this boundless power, shaping reality but bound by ancient constraints. \n\n 2. **Celestial Energy (Pure Form):** A refined form of Primordial Energy used by divine beings. They govern natural elements, influence mortals, and maintain order, occasionally accessing primordial forces through rituals and cosmic events. \n\n 3. **Mortal Energy (Derived Form):** A derivative of Celestial Energy empowering mortals. They use this for magic, technology, and spiritual practices, with exceptional individuals potentially tapping into higher forms of energy. \n\n This hierarchy defines interactions: \n\n - Primordial Energy dictates the universe's fundamental laws. \n\n - Celestial Beings influence mortals and access primordial forces with limitations. \n\n - Mortals are influenced by higher entities but can achieve remarkable feats and ascend through exceptional actions. \n\n Exploits exist: \n\n - Ancient artifacts or rituals may grant temporary access to higher energies, but with risks. \n\n - Cosmic alignments can offer unique opportunities for beings of all levels, creating moments of potential and danger. \n\n The Primordia System fosters a dynamic universe where beings can transcend their origins and achieve greater heights.",
      "category": "Power System"
    },
    {
      "name": "Law of Conservation of Energy",
      "description": "This fundamental law states that energy can neither be created nor destroyed, only transformed from one form to another. The total amount of energy in a closed system remains constant. This applies to all forms of energy, including kinetic (movement), potential (stored), thermal (heat), light, and even mass (through Einstein's famous equation E=mc^2).",
      "category": "Science Law"
    },
    {
      "name": "Newton's Second Law of Motion",
      "description": "This law describes the relationship between force, mass, and acceleration. It states that the acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass. In simpler terms, the more force applied to an object, the faster it will accelerate. However, a heavier object requires more force to achieve the same acceleration as a lighter object.",
      "category": "Science Law"
    },
    {
      "name": "Second Law of Thermodynamics",
      "description": "This law deals with entropy, a measure of disorder within a system. It states that in any isolated system, the entropy tends to increase over time. Essentially, closed systems naturally move towards a state of greater disorder. This applies to processes like heat transfer, chemical reactions, and even the expansion of the universe.",
      "category": "Science Law"
    },
    {
      "name": "Adevarian System",
      "description": "A structured system of power established by the supreme god Adevar within his own world/universe. It draws upon the fundamental principles of the Primordia Hierarchy Law, but tailors them to the specific needs and characteristics of his creation.",
      "category": "Power System"
    }
  ]
}
